import os
import string



c = ['未知角色', '日和', '優衣', '憐', '禊', '茉莉', '茜裏', '宮子', '雪', '杏奈', '真步', '璃乃', '初音', '七七香', '霞', '美裏', '鈴奈', '香織', '伊緒', '美美', '胡桃', '依裏', '綾音', '鈴莓', '鈴', '惠理子', '咲戀', '望', '妮諾', '忍', '秋乃', '真陽', '優花梨', '鏡華', '智', '栞', '碧', '千歌', '真琴', '伊莉亞', '空花', '珠希', '純', '美冬', '靜流', '美咲', '深月', '莉瑪', '莫妮卡', '紡希', '步未', '流夏', '吉塔', '貪吃佩可', '可可蘿', '凱留', '矛依未', '亞裏莎', '雪菲', '嘉夜', '祈梨', '穗希', '拉比林斯達', '真那', '似似花', '克莉絲提娜', '可蘿爹', '拉基拉基', '貪吃佩可(夏日)', '可可蘿(夏日)', '鈴莓(夏日)', '凱留(夏日)', '珠希(夏日)', '美冬(夏日)', '忍(萬聖節)', '宮子(萬聖節)', '美咲(萬聖節)', '千歌(聖誕節)', '胡桃(聖誕節)', '綾音(聖誕節)', '日和(新年)', '優衣(新年)', '憐(新年)', '惠理子(情人節)', '靜流(情人節)', '安', '露', '古蕾婭', '空花(大江戶)', '妮諾(大江戶)', '雷姆', '拉姆', '愛蜜莉雅', '鈴奈(夏日)', '伊緒(夏日)', '美咲(夏日)', '咲戀(夏日)', '真琴(夏日)', '香織(夏日)', '真步(夏日)', '碧(插班生)', '克蘿依', '琪愛兒', '優妮', '鏡華(萬聖節)', '禊(萬聖節)', '美美(萬聖節)', '露娜', '克莉絲提娜(聖誕節)', '望(聖誕節)', '伊莉亞(聖誕節)', '貪吃佩可(新年)', '可可蘿(新年)', '凱留(新年)', '鈴莓(新年)', '霞(魔法少女)', '栞(魔法少女)', '卯月(NGs)', '凜(NGs)', '未央(NGs)', '鈴(遊俠)', '真陽(遊俠)', '璃乃(奇幻)', '步未(奇幻)', '流夏(夏日)', '杏奈(夏日)', '七七香(夏日)', '初音(夏日)', '美裏(夏日)', '純(夏日)', '茜裏(天使)', '依裏(天使)', '紡希(萬聖節)', '憐(萬聖節)', '茉莉(萬聖節)', '莫妮卡(魔法少女)', '智(魔法少女)', '秋乃(聖誕節)', '咲戀(聖誕節)', '優花梨(聖誕節)', '矛依未(新年)', '似似花(新年)', '可可蘿(祭服)', '優衣(祭服)', '霞(夏日)', '莉瑪(灰姑娘)', '真琴(灰姑娘)', '真步(灰姑娘)', '克蘿依(聖學祭)', '琪愛兒(聖學祭)', '祈梨(時間旅行)', '嘉夜(時間旅行)', '碧(作業服)', '珠希(作業服)', '環奈', '環奈(振袖)', '日和(公主)', '優衣(公主)', '貪吃佩可(公主)', '可可蘿(公主)', '凱留(公主)', '愛梅斯', '菲歐', '大古', '花凜', '涅比亞', '真崎', '米涅爾β', '和正', '豪紳', '克裏吉塔', '基洛', '善', '蘭法', '阿佐爾德', '美空']


s = ['未知角色', '日和', '优衣', '怜', '禊', '茉莉', '茜里', '宫子', '雪', '杏奈', '真步', '璃乃', '初音', '七七香', '霞', '美里', '铃奈', '香织', '伊绪', '美美', '胡桃', '依里', '绫音', '铃莓', '铃', '惠理子', '咲恋', '望', '妮诺', '忍', '秋乃', '真阳', '优花梨', '镜华', '智', '栞', '碧', '千歌', '真琴', '伊莉亚', '空花', '珠希', '纯', '美冬', '静流', '美咲', '深月', '莉玛', '莫妮卡', '纺希', '步未', '流夏', '吉塔', '贪吃佩可', '可可萝', '凯留', '矛依未', '亚里莎', '雪菲', '嘉夜', '祈梨', '穗希', '拉比林斯达', '真那', '似似花', '克莉丝提娜', '可萝爹', '拉基拉基', '贪吃佩可(夏日)', '可可萝(夏日)', '铃莓(夏日)', '凯留(夏日)', '珠希(夏日)', '美冬(夏日)', '忍(万圣节)', '宫子(万圣节)', '美咲(万圣节)', '千歌(圣诞节)', '胡桃(圣诞节)', '绫音(圣诞节)', '日和(新年)', '优衣(新年)', '怜(新年)', '惠理子(情人节)', '静流(情人节)', '安', '露', '古蕾娅', '空花(大江户)', '妮诺(大江户)', '雷姆', '拉姆', '爱蜜莉雅', '铃奈(夏日)', '伊绪(夏日)', '美咲(夏日)', '咲恋(夏日)', '真琴(夏日)', '香织(夏日)', '真步(夏日)', '碧(插班生)', '克萝依', '琪爱儿', '优妮', '镜华(万圣节)', '禊(万圣节)', '美美(万圣节)', '露娜', '克莉丝提娜(圣诞节)', '望(圣诞节)', '伊莉亚(圣诞节)', '贪吃佩可(新年)', '可可萝(新年)', '凯留(新年)', '铃莓(新年)', '霞(魔法少女)', '栞(魔法少女)', '卯月(NGs)', '凛(NGs)', '未央(NGs)', '铃(游侠)', '真阳(游侠)', '璃乃(奇幻)', '步未(奇幻)', '流夏(夏日)', '杏奈(夏日)', '七七香(夏日)', '初音(夏日)', '美里(夏日)', '纯(夏日)', '茜里(天使)', '依里(天使)', '纺希(万圣节)', '怜(万圣节)', '茉莉(万圣节)', '莫妮卡(魔法少女)', '智(魔法少女)', '秋乃(圣诞节)', '咲恋(圣诞节)', '优花梨(圣诞节)', '矛依未(新年)', '似似花(新年)', '可可萝(祭服)', '优衣(祭服)', '霞(夏日)', '莉玛(灰姑娘)', '真琴(灰姑娘)', '真步(灰姑娘)', '克萝依(圣学祭)', '琪爱儿(圣学祭)', '祈梨(时间旅行)', '嘉夜(时间旅行)', '碧(作业服)', '珠希(作业服)', '环奈', '环奈(振袖)', '日和(公主)', '优衣(公主)', '贪吃佩可(公主)', '可可萝(公主)', '凯留(公主)', '爱梅斯', '菲欧', '大古', '花凛', '涅比亚', '真崎', '米涅尔β', '和正', '豪绅', '克里吉塔', '基洛', '善', '兰法', '阿佐尔德', '美空']

_tmp = ''
with open('s_name.py', 'r', encoding='utf-8') as f:
    _tmp = f.read()
    print(type(_tmp))
    for i in range(len(c)):
        _tmp = _tmp.replace(s[i], c[i])


with open('c_name.py', 'w', encoding='utf-8') as f:
    f.write(_tmp)